{"/en/about/":{"data":{"":"","qǝʍᴉʍǝp#qǝʍᴉʍǝp":"Stage manager based in Rennes, France. I work in live performance while developing open source tools at the intersection of digital and stage production.\nMy projects revolve around spatial audio, control protocols (OSC, Ember+, MIDI/XCTL) and practical utilities for production.\nWhat I do Live performance — Stage manager by training and practice, with a technical approach to the stage and production workflow Open source development — Active contributor on GitHub since 2013, projects in JavaScript, TypeScript, Rust, Python and C Technical integration — Specialised in interfacing stage and audiovisual equipment via open protocols Links GitHub — github.com/dewiweb Initiated projects Contributions "},"title":"About"},"/en/blog/":{"data":{"":"Notes and updates around the projects."},"title":"Notes"},"/en/docs/":{"data":{"":"This section gathers the GitHub repositories I initiated as well as open source projects I contribute to.\nInitiated projects — repositories I authored, organised by theme Contributions — forks and third-party projects I participate in "},"title":"Projects \u0026 Contributions"},"/en/docs/contributions/":{"data":{"":"These repositories are forks of existing projects I contribute to, or that I forked to adapt for my specific needs."},"title":"Contributions"},"/en/docs/contributions/aes67/":{"data":{"":"","aes67-linux-daemon#aes67-linux-daemon":"Fork · github.com/dewiweb/aes67-linux-daemon\nLinux daemon for AES67 audio transport with a WebUI for configuration.\nLanguage: C++ ","aes67-recorder#aes67-recorder":"Fork · github.com/dewiweb/aes67-recorder\nLinux/GStreamer-based AES67 multitrack audio backup solution.\nLanguage: Python ","aes67-web-monitor#aes67-web-monitor":"Fork · github.com/dewiweb/aes67-web-monitor\nTool to monitor AES67 streams via a web page: VU meter, RTP and timing statistics, PCM sound in the browser.\n⭐ 1 star ","mai#mai":"Fork · github.com/dewiweb/mai\nMark’s AES67 Implementation — a C implementation of the AES67 standard.\n⭐ 1 star · Language: C ","marian-alsa-driver#MARIAN-ALSA-DRIVER":"Fork · github.com/dewiweb/MARIAN-ALSA-DRIVER\nALSA driver for MARIAN audio interfaces."},"title":"AES67"},"/en/docs/contributions/audio-spatial/":{"data":{"":"","sparta#SPARTA":"Fork · github.com/dewiweb/SPARTA\nCollection of VST audio plugins for spatial audio production, reproduction and visualisation. Suite developed by Aalto University.\nLanguage: C++ Licence: GPL-3.0 Original project ","trajectoires#trajectoires":"Fork · github.com/dewiweb/trajectoires\nMobile/web application for spatial audio control via OSC. Fork of the original, adapted and used as a working base.\nLanguage: Objective-C Usage: OSC control of sound sources from mobile ","visr-production-suite#VISR-Production-Suite":"Fork · github.com/dewiweb/VISR-Production-Suite\nSuite of audio plugins for spatial production, from the S3A research project.\nLanguage: C++ Official site "},"title":"Spatial audio"},"/en/docs/contributions/broadcast-media/":{"data":{"":"","bm-camera-control-webui#BM-Camera-Control-WebUI":"Fork · github.com/dewiweb/BM-Camera-Control-WebUI\nExtensible web interface for Blackmagic camera control.\nLanguage: JavaScript ","ear-production-suite#ear-production-suite":"Fork · github.com/dewiweb/ear-production-suite\nVST plugin suite for producing and reproducing immersive and personalisable audio, based on the Audio Definition Model (ADM) and ITU renderer.\n⭐ 1 star ","media-network-manager-cloud#media-network-manager-cloud":"Fork · github.com/dewiweb/media-network-manager-cloud\nMnMs — set of tools for monitoring and administering real-time media networks (ST2110, AES67, Dante…).","pam#pam":"Fork · github.com/dewiweb/pam\nAudio Monitoring Software designed to run on a Raspberry Pi with touchscreen.\n⭐ 1 star · Language: C++ ","pi-list#pi-list":"Fork · github.com/dewiweb/pi-list\nLive IP Software Toolkit from the EBU to assist in implementing IP facilities (ST2110, AES67). Analysis and monitoring tool for IP media streams.\nLanguage: C++ ","sofie-emberplus-connection#sofie-emberplus-connection":"Fork · github.com/dewiweb/sofie-emberplus-connection\nEmber+ connection layer for Sofie — the modern TV news studio automation system. TypeScript Ember+ communication layer.\nLanguage: TypeScript "},"title":"Broadcast"},"/en/docs/contributions/outils/":{"data":{"":"","iannix#IanniX":"Fork · github.com/dewiweb/IanniX\nIanniX is an open source graphical sequencer inspired by Iannis Xenakis, designed for digital art. It synchronises events and curves via OSC to real-time environments (Max/MSP, Pure Data, SuperCollider…).\nLanguage: C++ (Qt) Licence: GPL-3.0 Official site ","scenic#scenic":"Fork · github.com/dewiweb/scenic\nTelepresence application for live performances and artistic installations. Allows sharing of video, audio and data streams between remote sites.\nLanguage: Python Licence: GPL-3.0 Documentation "},"title":"Tools"},"/en/docs/contributions/protocoles/":{"data":{"":"","ember-plus#ember-plus":"Fork · github.com/dewiweb/ember-plus\nThe official Ember+ protocol from Lawo — an open control protocol for the broadcast and audiovisual industry. Used to communicate between broadcast equipment (mixers, routers, monitoring systems).\nLanguage: C++ Licence: BSL-1.0 Original project ","ember-plus-sharp#ember-plus-sharp":"Fork · github.com/dewiweb/ember-plus-sharp\nEmber+ implementation for .NET, enabling the rapid creation of fully-typed Ember+ consumers in any .NET language.\nLanguage: C# Licence: BSL-1.0 Documentation ","oscrouter#OSCRouter":"Fork · github.com/dewiweb/OSCRouter\nSimple UDP/TCP packet router for Mac and Windows with OSC-specific options. Redistributes OSC messages between multiple applications or devices.\nLanguage: C++ Licence: MIT "},"title":"Control protocols"},"/en/docs/contributions/show-control/":{"data":{"":"","adm-osc#ADM-OSC":"Fork · github.com/dewiweb/ADM-OSC\nOSC dictionary implementing the Audio Definition Model (ADM) — standard for object-based and immersive audio.","behringer-x-touch-extender-chataigne-module#Behringer-x-Touch-Extender-Chataigne-Module":"Fork · github.com/dewiweb/Behringer-x-Touch-Extender-Chataigne-Module\nChataigne module for the Behringer X-Touch Extender controller.\nLanguage: JavaScript ","chataigne#Chataigne":"Fork · github.com/dewiweb/Chataigne\nArtist-friendly modular machine for art and technology by Benjamin Kuperberg. Central show control tool used with several of my modules.\nLanguage: C++ ","companion#companion":"Fork · github.com/dewiweb/companion\nBitfocus Companion — turns an Elgato Stream Deck into a professional control surface for broadcast and stage equipment.\nLanguage: JavaScript ","companion-module-denon-recorder#companion-module-denon-recorder":"Fork · github.com/dewiweb/companion-module-denon-recorder\nCompanion module for Denon recorders.\nLanguage: JavaScript ","midimonster#midimonster":"Fork · github.com/dewiweb/midimonster\nMulti-protocol control \u0026 translation software: ArtNet, MIDI, OSC, sACN and more.","open-stage-control#open-stage-control":"Fork · github.com/dewiweb/open-stage-control\nLibre and modular OSC/MIDI controller. Customisable web interface to drive any system via OSC or MIDI.\nLanguage: JavaScript ","sisyfos-audio-controller#sisyfos-audio-controller":"Fork · github.com/dewiweb/sisyfos-audio-controller\nIntelligent audio controller for automation systems (broadcast). Manages routing and mixing via a web interface.\nLanguage: TypeScript ","xtouch-universal-chataigne-module#XTouch-Universal-Chataigne-Module":"Fork · github.com/dewiweb/XTouch-Universal-Chataigne-Module\nUniversal Chataigne module for Behringer X-Touch surfaces."},"title":"Show control"},"/en/docs/projets/":{"data":{"":"These are the repositories I created and maintain. They mainly cover spatial audio, stage control protocols and utility tools."},"title":"Initiated projects"},"/en/docs/projets/audio-spatial/":{"data":{"":"Projects around 3D audio, immersive sound and tools for driving spatialisation systems."},"title":"Spatial audio"},"/en/docs/projets/audio-spatial/alsa-ravenna-aes67/":{"data":{"":"","features#Features":" Linux kernel module (Loadable Kernel Module) RAVENNA/AES67 audio transport over IP Native ALSA integration Compatible with Merging Technologies equipment and other AES67 devices ","links#Links":" GitHub repository Original source (Merging Technologies) Language: C Topics: aes67 alsa driver linux ","overview#Overview":"Clone of the ALSA RAVENNA/AES67 driver originally provided by Merging Technologies. This Linux kernel module (LKM) enables the RAVENNA network audio transport protocol (compatible with AES67) within the ALSA subsystem on Linux.\nRAVENNA/AES67 is a professional audio-over-IP transport standard used in studios, concert halls and broadcast installations.","status#Status":"⭐ 53 stars · 10 forks"},"title":"ALSA RAVENNA/AES67"},"/en/docs/projets/audio-spatial/chataigne-spatiale/":{"data":{"":"","features#Features":" Control Holophonix sources from Chataigne Bidirectional OSC communication Integration into show control workflows ","links#Links":" GitHub repository Language: Python ","overview#Overview":"A Python module integrating the Holophonix spatial audio processor into Chataigne — a modular software for arts and technology. Drives spatial sound sources from Chataigne’s interface via OSC.","status#Status":"⭐ 7 stars · active"},"title":"chataigne_spatiale"},"/en/docs/projets/audio-spatial/holophonix-animator/":{"data":{"":"","features#Features":" Create movement behaviours (circles, lines, free trajectories) Manage multiple tracks simultaneously OSC synchronisation with Holophonix Desktop GUI (Electron/Node.js) ","links#Links":" GitHub repository Language: JavaScript/TypeScript ","overview#Overview":"Desktop application for creating and managing movement animations for spatial audio tracks on the Holophonix processor.\nIt communicates with Holophonix via the OSC protocol and lets you define trajectories and dynamic behaviours for sound sources in 3D space."},"title":"holophonix-animator"},"/en/docs/projets/audio-spatial/holophonix-chataigne-module/":{"data":{"":"","features#Features":" Control Holophonix spatial audio sources from Chataigne Read/write parameters via OSC Integration into complex show control workflows Compatible with recent Holophonix versions ","links#Links":" GitHub repository Language: JavaScript ","overview#Overview":"A Chataigne module dedicated to the Holophonix spatial audio processor. Natively integrates Holophonix into Chataigne to drive sound sources, read states and automate behaviours in a show control context.","status#Status":"⭐ 6 stars · active"},"title":"Holophonix-chataigne-module"},"/en/docs/projets/audio-spatial/spacemouse-osc/":{"data":{"":"","features#Features":" Read 6DoF data (X/Y/Z translation + rotation) from the SpaceMouse Convert and send data as OSC messages Configurable mappings (axes, OSC addresses, value ranges) Low latency for real-time control ","links#Links":" GitHub repository Language: JavaScript Licence: MIT Topics: 3dconnexion 6dof osc spacemouse spatial-audio ","overview#Overview":"Bridge between the 3Dconnexion SpaceMouse Compact and the OSC (Open Sound Control) protocol. Lets you use the 6DoF (6 degrees of freedom) controller to drive sound sources in 3D space in real time.\nParticularly well suited to controlling spatialisation systems such as Holophonix, Max/MSP or SuperCollider.","status#Status":"⭐ 14 stars · 1 fork · active"},"title":"spacemouse-osc"},"/en/docs/projets/audio-spatial/trajectoires-modern/":{"data":{"":"","features#Features":" GUI for defining movement trajectories Real-time OSC output Modern TypeScript architecture Compatible with OSC systems (Holophonix, Max/MSP, etc.) ","links#Links":" GitHub repository Language: TypeScript ","overview#Overview":"Full rewrite of the Trajectoires application, a web/mobile interface for controlling sound spatialisation via OSC. This modernised version is developed in TypeScript with a revised architecture.\nTrajectoires lets you draw and animate trajectories for sound sources in space, then send them in real time to a spatialisation system."},"title":"trajectoires-modern"},"/en/docs/projets/outils-sceniques/":{"data":{"":"Utilities developed to address concrete needs in stage production and live performance."},"title":"Stage tools"},"/en/docs/projets/outils-sceniques/companion-modules/":{"data":{"":"","companion-module-canon-network-legacy-http#companion-module-canon-network-legacy-http":"Repository · github.com/dewiweb/companion-module-canon-network-legacy-http\nCompanion module for controlling Canon cameras via the legacy HTTP network API. Allows driving compatible Canon cameras from a Stream Deck.\nLanguage: JavaScript · Protocol: HTTP ","companion-module-powersoft-amplifier#companion-module-powersoft-amplifier":"Repository · github.com/dewiweb/companion-module-powersoft-amplifier\nCompanion module for controlling Powersoft amplifiers. Monitor and control Powersoft amps (X series, Quattrocanali, etc.) from a Stream Deck.\nLanguage: TypeScript ","overview#Overview":"Bitfocus Companion turns an Elgato Stream Deck into a professional control surface for broadcast and stage equipment. These modules integrate specific devices."},"title":"Companion modules"},"/en/docs/projets/outils-sceniques/holophonix-blender-addon/":{"data":{"":"","features#Features":" Manage Holophonix tracks from Blender Configure speakers (positions, groups) Manage OSC handlers Direct OSC operations to Holophonix 3D visualisation of the sound scene in Blender ","links#Links":" GitHub repository Language: Python ","overview#Overview":"A Blender addon providing utility functions for Holophonix projects, including management of tracks, speakers, handlers and OSC operations directly from Blender’s interface.\nCombines Blender’s 3D visualisation power with the Holophonix spatialisation engine."},"title":"holophonix_blender_addon"},"/en/docs/projets/outils-sceniques/music-constellation/":{"data":{"":"","features#Features":" Connect to a beets library (via the beets web API) SVG/Canvas constellation graph representation Interactive navigation (zoom, pan, select) Filter by genre, decade, artist ","links#Links":" GitHub repository Language: TypeScript ","overview#Overview":"A web application that represents a beets music library as an interactive constellation. Each star is an album or artist, and the links between them illustrate relationships (genres, years, similarities).\nA poetic, visual way to explore your music collection.","stack#Stack":" TypeScript Visualisation: D3.js or Canvas Backend: beets API "},"title":"music-constellation"},"/en/docs/projets/outils-sceniques/rpi-media-kiosk/":{"data":{"":"","features#Features":" Autoplay on boot Supports: video, PDF, PowerPoint (converted), image slideshows Load from USB stick or local storage Chromium in kiosk mode (full-screen, no UI) Simple configuration ","links#Links":" GitHub repository Language: HTML/Shell ","overview#Overview":"A plug-and-play solution to turn any Raspberry Pi into a full-screen media kiosk player. Automatically plays videos, PowerPoint presentations, PDFs and image slideshows from a USB stick or local storage — all rendered via Chromium.\nIdeal for installations, exhibitions, digital signage or any stage use case requiring automatic media playback.","requirements#Requirements":" Raspberry Pi (any recent generation) Raspberry Pi OS Chromium (included by default on Raspberry Pi OS) "},"title":"rpi-media-kiosk"},"/en/docs/projets/protocoles/":{"data":{"":"Projects around protocols used to interconnect stage equipment: OSC, Ember+, XCTL."},"title":"Control protocols"},"/en/docs/projets/protocoles/emberplus-rust/":{"data":{"":"","features#Features":" Ember+ client (consumer) implementation Ember+ server (provider) implementation Written in Rust (performance, memory safety) ","links#Links":" GitHub repository Language: Rust ","overview#Overview":"A Rust implementation of the Ember+ protocol, covering both the client (consumer) and server (provider) roles.\nEmber+ is a control protocol used in the broadcast and audiovisual industry for communication between equipment (mixers, routers, monitoring systems…).","why-rust#Why Rust?":"Rust provides excellent memory-safety guarantees and performance for a low-level protocol like Ember+, which requires reliable, low-latency communication."},"title":"emberplus_rust"},"/en/docs/projets/protocoles/mcxosc/":{"data":{"":"","features#Features":" Bidirectional Ember+ ↔ OSC translation Adapted to Lawo MCx console specifics Interfacing with show control systems via OSC ","links#Links":" GitHub repository Language: JavaScript ","overview#Overview":"A bridge between the Ember+ and OSC protocols, specifically designed for Lawo MCx consoles. Allows controlling and monitoring an MCx console from any OSC environment (Chataigne, Max/MSP, QLab, etc.).","status#Status":"⭐ 6 stars · active"},"title":"MCxOSC"},"/en/docs/projets/protocoles/mcxoscnext/":{"data":{"":"","features#Features":" Ember+ ↔ OSC bridge with improved architecture Better error handling and automatic reconnection Compatible with any Ember+ device, not only Lawo MCx ","links#Links":" GitHub repository Language: JavaScript ","overview#Overview":"A rewrite and evolution of MCxOSC — an Ember+ to OSC bridge. Revised architecture for greater robustness and flexibility, compatible with a wider range of Ember+ equipment.","status#Status":"⭐ 4 stars · active"},"title":"MCxOSCnext"},"/en/docs/projets/protocoles/xctl/":{"data":{"":"","contents#Contents":" XCTL message structure Control mapping (faders, encoders, buttons, LEDs, displays) JavaScript implementation examples Comparison with HUI and Mackie Control protocols ","links#Links":" GitHub repository Online documentation Language: JavaScript Licence: GPL-3.0 ","overview#Overview":"Reference documentation for the XCTL protocol used by Behringer X-Touch mixing consoles (and compatible surfaces). This MIDI-extended protocol enables bidirectional communication between the control surface and a DAW or custom control system.\nThis repository collects information gathered through reverse engineering and community documentation — officially undocumented by Behringer.","status#Status":"⭐ 2 stars · Active · GitHub Pages available"},"title":"XCTL (Behringer)"}}