{"/about/":{"data":{"":"","qǝʍᴉʍǝp#qǝʍᴉʍǝp":"Stage manager basé à Rennes, France. Je travaille dans le spectacle vivant tout en développant des outils open source à l’intersection du numérique et de la scène.\nMes projets gravitent autour de l’audio spatial, des protocoles de contrôle (OSC, Ember+, MIDI/XCTL) et d’utilitaires pratiques pour la production.\nCe que je fais Spectacle vivant — Stage manager de formation et de pratique, approche technique du plateau et de la production Développement open source — Contributeur actif sur GitHub depuis 2013, projets en JavaScript, TypeScript, Rust, Python et C Intégration technique — Spécialisé dans l’interfaçage d’équipements scéniques et audiovisuels via des protocoles ouverts Liens GitHub — github.com/dewiweb Projets initiés Contributions "},"title":"À propos"},"/blog/":{"data":{"":"Notes et actualités autour des projets."},"title":"Notes"},"/docs/":{"data":{"":"Cette section regroupe les dépôts GitHub dont je suis l’initiateur ainsi que les projets open source auxquels je contribue.\nProjets initiés — dépôts dont je suis l’auteur principal, classés par thématique Contributions — forks et projets tiers auxquels je participe "},"title":"Projets \u0026 Contributions"},"/docs/contributions/":{"data":{"":"Ces dépôts sont des forks de projets existants auxquels je contribue, ou que j’ai forkés pour les adapter à mes besoins spécifiques."},"title":"Contributions"},"/docs/contributions/audio-spatial/":{"data":{"":"","sparta#SPARTA":"Fork · github.com/dewiweb/SPARTA\nCollection de plugins VST audio pour la production, reproduction et visualisation d’audio spatial. Suite développée par Aalto University.\nLangage : C++ Licence : GPL-3.0 Projet original ","trajectoires#trajectoires":"Fork · github.com/dewiweb/trajectoires\nApplication mobile/web pour le contrôle de la spatialisation sonore via OSC. Fork de l’original, adapté et utilisé comme base de travail.\nLangage : Objective-C Usage : contrôle OSC de sources sonores depuis mobile ","visr-production-suite#VISR-Production-Suite":"Fork · github.com/dewiweb/VISR-Production-Suite\nSuite de plugins audio pour la production spatiale, issue du projet de recherche S3A.\nLangage : C++ Site officiel "},"title":"Audio spatial"},"/docs/contributions/outils/":{"data":{"":"","iannix#IanniX":"Fork · github.com/dewiweb/IanniX\nIanniX est un séquenceur graphique open source basé sur les travaux d’Iannis Xenakis, destiné à l’art numérique. Il synchronise via OSC des événements et des courbes vers des environnements temps réel (Max/MSP, Pure Data, SuperCollider…).\nLangage : C++ (Qt) Licence : GPL-3.0 Site officiel ","scenic#scenic":"Fork · github.com/dewiweb/scenic\nApplication de téléprésence pour les performances live et les installations artistiques. Permet de partager flux vidéo, audio et données entre sites distants.\nLangage : Python Licence : GPL-3.0 Documentation "},"title":"Outils"},"/docs/contributions/protocoles/":{"data":{"":"","ember-plus#ember-plus":"Fork · github.com/dewiweb/ember-plus\nLe protocole Ember+ officiel de Lawo — protocole de contrôle ouvert pour l’industrie broadcast et audiovisuelle. Utilisé pour communiquer entre équipements de diffusion (mixeurs, routeurs, systèmes de monitoring).\nLangage : C++ Licence : BSL-1.0 Projet original ","ember-plus-sharp#ember-plus-sharp":"Fork · github.com/dewiweb/ember-plus-sharp\nImplémentation Ember+ pour .NET, permettant de créer rapidement des consumers Ember+ entièrement typés dans n’importe quel langage .NET.\nLangage : C# Licence : BSL-1.0 Documentation ","oscrouter#OSCRouter":"Fork · github.com/dewiweb/OSCRouter\nRouteur de paquets UDP/TCP simple pour Mac et Windows, avec options spécifiques OSC. Permet de redistribuer des messages OSC entre plusieurs applications ou équipements.\nLangage : C++ Licence : MIT "},"title":"Protocoles"},"/docs/projets/":{"data":{"":"Voici les dépôts que j’ai créés et que je maintiens. Ils couvrent principalement l’audio spatial, les protocoles de contrôle scénique et les outils utilitaires."},"title":"Projets initiés"},"/docs/projets/audio-spatial/":{"data":{"":"Projets autour de l’audio 3D, du son immersif et des outils de pilotage de systèmes de spatialisation."},"title":"Audio spatial"},"/docs/projets/audio-spatial/alsa-ravenna-aes67/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Driver noyau Linux (Loadable Kernel Module) Transport audio RAVENNA/AES67 sur réseau IP Intégration native avec ALSA Compatible avec les équipements Merging Technologies et autres appareils AES67 ","liens#Liens":" Dépôt GitHub Source originale (Merging Technologies) Langage : C Topics : aes67 alsa driver linux ","présentation#Présentation":"Clone du driver ALSA RAVENNA/AES67 originellement fourni par Merging Technologies. Ce driver noyau Linux (LKM) permet d’utiliser le protocole de transport audio réseau RAVENNA (compatible AES67) avec l’architecture ALSA sous Linux.\nRAVENNA/AES67 est un standard de transport audio professionnel sur réseau IP, utilisé dans les studios, salles de concert et installations de diffusion.","statut#Statut":"⭐ 53 étoiles · 10 forks"},"title":"ALSA RAVENNA/AES67"},"/docs/projets/audio-spatial/holophonix-animator/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Création de comportements de mouvement (cercles, lignes, trajectoires libres) Gestion de plusieurs pistes simultanées Synchronisation OSC avec Holophonix Interface graphique desktop (Electron/Node.js) ","liens#Liens":" Dépôt GitHub Langage : JavaScript/TypeScript ","présentation#Présentation":"Application desktop permettant de créer et gérer des animations de mouvement pour les pistes audio spatiales du processeur Holophonix.\nElle communique avec Holophonix via le protocole OSC et permet de définir des trajectoires et comportements dynamiques pour les sources sonores dans l’espace 3D."},"title":"holophonix-animator"},"/docs/projets/audio-spatial/spacemouse-osc/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Lecture des données 6DoF (translation X/Y/Z + rotation) de la SpaceMouse Conversion et envoi des données en messages OSC Mappages configurables (axes, adresses OSC, plages de valeurs) Faible latence pour le contrôle en temps réel ","liens#Liens":" Dépôt GitHub Langage : JavaScript Licence : MIT Topics : 3dconnexion 6dof osc spacemouse spatial-audio ","présentation#Présentation":"Passerelle entre la SpaceMouse Compact de 3Dconnexion et le protocole OSC (Open Sound Control). Permet d’utiliser le contrôleur 6DoF (6 degrés de liberté) pour piloter des sources sonores dans l’espace 3D en temps réel.\nParticulièrement adapté au contrôle de systèmes de spatialisation comme Holophonix, Max/MSP ou SuperCollider.","statut#Statut":"⭐ 14 étoiles · 1 fork · actif"},"title":"spacemouse-osc"},"/docs/projets/audio-spatial/trajectoires-modern/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Interface graphique pour définir des trajectoires de mouvement Envoi en temps réel via OSC Architecture moderne TypeScript Compatible avec les systèmes OSC (Holophonix, Max/MSP, etc.) ","liens#Liens":" Dépôt GitHub Langage : TypeScript ","présentation#Présentation":"Refonte complète de l’application Trajectoires, une interface web/mobile pour le contrôle de la spatialisation sonore via OSC. Cette version modernisée est développée en TypeScript avec une architecture revue.\nTrajectoires permet de dessiner et animer des trajectoires de sources sonores dans l’espace, puis de les envoyer en temps réel vers un système de spatialisation."},"title":"trajectoires-modern"},"/docs/projets/outils-sceniques/":{"data":{"":"Utilitaires et outils développés pour répondre à des besoins concrets de la production scénique et du spectacle vivant."},"title":"Outils scéniques"},"/docs/projets/outils-sceniques/music-constellation/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Connexion à la bibliothèque beets (via l’API web de beets) Représentation en graphe de constellation SVG/Canvas Navigation interactive (zoom, déplacement, sélection) Filtrage par genre, décennie, artiste ","liens#Liens":" Dépôt GitHub Langage : TypeScript ","présentation#Présentation":"Application web qui représente une bibliothèque musicale gérée par beets sous forme de constellation interactive. Chaque étoile est un album ou un artiste, et les liens entre elles illustrent les relations (genres, années, similarités).\nUne façon poétique et visuelle d’explorer sa collection musicale.","stack-technique#Stack technique":" TypeScript Visualisation : D3.js ou Canvas Backend : API beets "},"title":"music-constellation"},"/docs/projets/outils-sceniques/rpi-media-kiosk/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Lecture automatique au démarrage Supporte : vidéos, PDF, PowerPoint (converti), diaporamas d’images Chargement depuis clé USB ou stockage local Interface Chromium en mode kiosk (plein écran, sans UI) Configuration simple ","liens#Liens":" Dépôt GitHub Langage : HTML/Shell ","prérequis#Prérequis":" Raspberry Pi (toute génération récente) Raspberry Pi OS Chromium (inclus par défaut sur Raspberry Pi OS) ","présentation#Présentation":"Solution clé en main pour transformer n’importe quel Raspberry Pi en lecteur média kiosk plein écran. Lit automatiquement des vidéos, présentations PowerPoint, PDF et diaporamas d’images depuis une clé USB ou le stockage local — le tout rendu via Chromium.\nIdéal pour les installations, expositions, signalétique numérique ou tout usage scénique nécessitant une lecture automatique de médias."},"title":"rpi-media-kiosk"},"/docs/projets/protocoles/":{"data":{"":"Projets autour des protocoles utilisés pour interconnecter les équipements de scène : OSC, Ember+, XCTL."},"title":"Protocoles"},"/docs/projets/protocoles/emberplus-rust/":{"data":{"":"","fonctionnalités#Fonctionnalités":" Implémentation client Ember+ (consumer) Implémentation serveur Ember+ (provider) Développé en Rust (performances, sécurité mémoire) ","liens#Liens":" Dépôt GitHub Langage : Rust ","pourquoi-rust-#Pourquoi Rust ?":"Rust offre d’excellentes garanties de sécurité mémoire et de performances pour un protocole bas niveau comme Ember+, qui nécessite une communication fiable et à faible latence.","présentation#Présentation":"Implémentation en Rust du protocole Ember+, couvrant à la fois le rôle de client (consumer) et de serveur (provider).\nEmber+ est un protocole de contrôle utilisé dans l’industrie broadcast et audiovisuelle pour la communication entre équipements (mixeurs, routeurs, systèmes de monitoring…)."},"title":"emberplus_rust"},"/docs/projets/protocoles/xctl/":{"data":{"":"","contenu#Contenu":" Structure des messages XCTL Mappage des contrôles (faders, encodeurs, boutons, LEDs, afficheurs) Exemples d’implémentation en JavaScript Comparaison avec le protocole HUI et Mackie Control ","liens#Liens":" Dépôt GitHub Documentation en ligne Langage : JavaScript Licence : GPL-3.0 ","présentation#Présentation":"Documentation de référence sur le protocole XCTL utilisé par les consoles de mixage Behringer X-Touch (et compatibles). Ce protocole, basé sur MIDI étendu, permet la communication bidirectionnelle entre la surface de contrôle et un logiciel DAW ou un système de contrôle personnalisé.\nCe dépôt rassemble les informations collectées par rétro-ingénierie et documentation communautaire, qui sont peu ou pas documentées officiellement par Behringer.","statut#Statut":"⭐ 2 étoiles · Actif · Pages GitHub disponibles"},"title":"XCTL (Behringer)"}}